[
    {
      "link": "https://blockchain.news/news/animoca-brands-japanese-unit-raises-45m",
      "type": "news article",
      "title": "Animoca Brands' Japanese Unit Raises $45m",
      "summary": "Animoca Brands' Japanese unit raised $45 million in financing at a $500 million pre-money valuation.",
      "content": "Animoca Brands' Japanese unit raised $45 million in financing at a $500 million pre-money valuation.\nThe Hong Kong-based crypto gaming and web3 firm raised the fund with MUFG Bank - the largest bank in Japan with a 360-year-old history.\nAnimoca Brands Japan has planned to use the fund to \"secure licenses for popular intellectual properties, develop internal capabilities, and promote adoption of Web3 to multiple partners, increasing the value and utility of their branded content while fostering the development of a safe and secure NFT ecosystem in Japan.\"\nAlthough Japan is not a crypto-friendly country yet imposing a 30% corporate tax on profit from cryptocurrency holdings, the island-nation is ripe with anime, manga, video games, movies, and musicians, which could be turned into the non-fungible token (NFT) services scouring for IPs.\nHowever, tech firms in Japan have been opening up to NFTs. Line launched its NFT marketplace in Japan in April, a plan that was announced last year.\nLine users in Japan can now store their NFTs in their Line-powered digital asset wallet and trade them with friends.\nAccording to a report from Blockchain.News, Animoca Brands announced in mid-July that it had raised $75 million in a funding round.\nInvestors backed the digital entertainment, blockchain, and gamification firm at a subscription price of A$4.50 per share for a total of 23,237,058 new shares, according to details of the fundraising.\nThe report added that the funding round placed Animoca Brands at a pre-money valuation of $5.9 billion enjoined high profile investors, including Liberty City Ventures, Kingsway Capital, Alpha Wave Ventures, 10T, SG Spring Limited Partnership Fund, Generation Highway Ltd, Cosmic Summit Investments Limited, and others.\nThe funding round is an extension of the $358 million boosts the firm received back in January as its valuation remained pegged at $5 billion at the time.",
      "date": "2022-08-26",
      "author": "aaron limbu",
      "tagList": [
        "blockchain",
        "bitcoin",
        "animocabrands",
        "nft",
        "crypto",
        "web3"
      ]
    },
    {
      "link": "https://blockchain.news/news/tether-launches-stablecoin-backed-by-offshore-chinese-yuan",
      "type": "news article",
      "title": "Tether Launches Stablecoin Backed by Offshore Chinese Yuan",
      "summary": "Reported in late August, Tether had made plans to add a new stablecoin pegged to the Chinese Yuan, named “CNHT.”",
      "content": "",
      "date": "2019-09-10",
      "author": "sarah tran",
      "tagList": [
        "blockchain",
        "bitcoin"
      ]
    },
    {
      "link": "https://blockchain.news/news/sahara-secures-6m-seed-funding-to-revolutionize-knowledge-sharing-with-ai-and-blockchain",
      "type": "news article",
      "title": "Sahara Secures $6M Seed Funding to Revolutionize Knowledge Sharing with AI and Blockchain",
      "summary": "Sahara, a decentralized AI network, has raised $6 million in a seed funding round led by Polychain Capital to transform knowledge sharing and monetization using AI and blockchain technologies.",
      "content": "Sahara, a decentralized AI network aiming to revolutionize the way knowledge is owned, shared, and monetized globally, has announced the successful completion of its $6 million seed funding round. The round was led by Polychain Capital, with participation from notable investors such as Samsung Next, Matrix Partners, Motherson Group, dao5, Geekcartel, Canonical Crypto, Nomad Capital, Dispersion Capital, Alumni Ventures, Tangent Ventures, and Coho Deeptech. Angel investor Sandeep Nailwal also participated in the round.\nThe Sahara network enables individuals and businesses to create customized, autonomous Knowledge Agents (Sahara KA) in a trustless, permissionless, and privacy-centric environment. By leveraging this decentralized network, users can explore monetization and automation opportunities for their knowledge capital through AI while ensuring data sovereignty and reducing the risks associated with centralized control of data.\nCo-founded in May 2023 by Professor Sean Ren and Tyler Zhou, Sahara boasts a team of experts from the AI and web3 industries. Professor Sean Ren, who serves as the Co-Founder and CEO, has made significant contributions to AI research and innovation, earning accolades such as Samsung AI Researcher of the Year, MIT TR Innovator under 35 (Asia Pacific), and Forbes' Asia 30 Under 30. Tyler Zhou, the Co-Founder and COO, brings extensive experience in the blockchain industry, having previously served as the Investment Director at Binance Labs.\nSahara's product suite encompasses infrastructure and applications that support various use cases, including business, consumer, research, and developer needs. The two cornerstone products are Sahara Knowledge Agent (KA) and Sahara Data. Sahara KA is an AI that goes beyond conversational capabilities, autonomously analyzing both external and internal proprietary data to offer reliable, personalized decision-making. Sahara Data provides high-value data services for AI model training while addressing security and privacy concerns in data handling.\nSince its inception, Sahara has attracted over 30 enterprise clients, ranging from Fortune 500 companies to unicorn startups, including Microsoft, MIT, Motherson Group, and USC. The newly acquired funds will be utilized to expand Sahara's team and enhance its portfolio of AI and blockchain-enabled products. In the next year, the network plans to grow to encompass Sahara Vault, Sahara ID, and Sahara Network, allowing individuals and businesses to navigate freely within the Sahara ecosystem.\nLuke Pearson of Polychain Capital expressed his enthusiasm for Sahara's network, stating, \"The integration of blockchain technology with AI by Sahara not only enhances privacy and security but also ensures the traceability and acknowledgment of contributions. Sahara's innovative approach will unlock unparalleled opportunities for individuals and businesses alike, setting a new standard in the way we own, share, and monetize knowledge in the digital age.\"\nAs Sahara continues to develop its groundbreaking technology, the successful seed funding round marks a significant milestone in the company's mission to democratize global knowledge capital access and advance human-AI collaboration while respecting user sovereignty and promoting a sustainable digital economy.",
      "date": "2024-03-06",
      "author": "rebeca moen",
      "tagList": [
        "sahara",
        "ai",
        "blockchain",
        "knowledge sharing"
      ]
    },
    {
      "link": "https://blockchain.news/news/singapore-exchange-launches-sgx-iedge-bitcoin-index-and-iedge-ethereum-index-cryptocompare",
      "type": "news article",
      "title": "Singapore Exchange Launches SGX iEdge Bitcoin Index and iEdge Ethereum Index with CryptoCompare",
      "summary": "Singapore Exchange (SGX) will launch crypto indices—the iEdge Bitcoin Index and iEdge Ethereum Index.",
      "content": "Singapore Exchange (SGX) will launch crypto indices—the iEdge Bitcoin Index and iEdge Ethereum Index—in collaboration with UK-based cryptocurrency market data provider CryptoCompare.\nAccording to the official release shared with Blockchain.News on Sept. 1, Asia’s most international, multi-asset exchange, Singapore Exchange is collaborating with CryptoCompare to launch two new indices under the SGX Index suite. The iEdge Bitcoin Index and the iEdge Ethereum Index are the first digital currency indices to be rolled out.\nThrough technology, data and strategic partnerships, SGX Index Edge has in the past four years built up a wide array of indices for its clients covering thematic investing, smart beta, futures, fixed income and multi-asset solutions with crypto indices now as the latest addition\nSimon Karaban, Head of Index Services at SGX said:\nAccording to research data by CryptoCompare, the total assets under management (AUM) globally of digital asset tracker funds rose from US$220 million in March 2017 to over US$4.5 billion by June 2020, representing a compound annual growth rate of 148%. While much of the AUM is currently captured by asset managers based in the United States and the Europe, Middle East, and Africa (EMEA) region, Asia is well-positioned to raise its share of this global AUM given that Asian fiat-crypto trading pairs now account for 43% of total global spot volumes.\nJames Harris, Commercial Director of CryptoCompare said:",
      "date": "2020-09-01",
      "author": "lucas cacioli",
      "tagList": [
        "singapore exchange",
        "sgx",
        "iedge",
        "blockchain",
        "bitcoin",
        "ethereum",
        "index",
        "cryptocompare"
      ]
    },
    {
      "link": "https://blockchain.news/news/grayscale-launches-bitcoin-mining-centered-investment-entity",
      "type": "news article",
      "title": "Grayscale Launches Bitcoin Mining-Centered Investment Entity",
      "summary": "Crypto asset management firm Grayscale plans to launch a new private co-investment opportunity in mining hardware that enriches the bitcoin ecosystem.",
      "content": "Crypto asset management firm Grayscale, on October 6, announced its latest launch, Grayscale Digital Infrastructure Opportunities LLC, a private co-investment opportunity that will allow accredited investors to access infrastructure that powers the digital asset ecosystem.\nGrayscale plans to launch a new private co-investment opportunity in mining hardware to enrich the bitcoin ecosystem. According to the statement, this newly launched project is “designed to capture the upside of crypto winter.”\nThe company stated that by leveraging the operating expertise of its affiliated digital asset mining, staking infrastructure firm, Foundry, to manage the day-to-day operations of GDIO (Grayscale Digital Infrastructure Opportunities), it plans to acquire mining equipment at reduced prices during the crypto winter.\n\"GDIO will use invested capital to purchase mining equipment. GDIO will then deploy this equipment to mine bitcoin, sell bitcoin daily, and distribute cash generated to investors, generating income,” said Rayhaneh Sharif-Askary, Grayscale head of investor relations.\nFoundry, or Foundry USA, is under the same parent company as Grayscale, the Digital Currency Group. Foundry works as one of the biggest mining pools globally. Last year, Foundry USA ranked as the second-largest Bitcoin mining pool after China’s ban on crypto trading and mining activities.\n“As part of Foundry’s mission to empower a decentralized infrastructure, we’re excited to partner with Grayscale to broaden the ability to invest in bitcoin mining during this opportune time,\" said Foundry CEO Michael Colyer in a press statement from Grayscale.\nFurthermore, Grayscale said GDIO is now open for investment by the eligible individual and accredited institutional investors.\n“Our team has long been committed to lowering the barrier for investing in the crypto ecosystem – from direct digital asset exposure to diversified thematic products, and now infrastructure through GDIO.” Said Grayscale CEO Michael Sonnenshein.\nIn March, Foundry digital became a member of the Blockchain Association, a community of industry leaders advocating for the collaboration and innovation necessary to support American leadership in the crypto industry.",
      "date": "2022-10-07",
      "author": "samuel edyme",
      "tagList": [
        "blockchain",
        "bitcoin",
        "grayscale",
        "mining",
        "digitialassests"
      ]
    },
    {
      "link": "https://blockchain.news/news/global-shipping-business-network-(gsbn)-bullish-on-blockchain",
      "type": "news article",
      "title": "Global Shipping Business Network (GSBN) Bullish on Blockchain",
      "summary": "Hong Kong-based nonprofit consortium Global Shipping Business Network (GSBN) remains optimistic about the potential of blockchain in logistics, with a platform that rivals Maersk's TradeLens. Major shipping partners like Cosco and Hapag-Lloyd have already joined, with a permissioned blockchain allowing only authorized parties to access data. Despite past failures, GSBN CEO Bertrand Chen believes blockchain has yet to fully catch on and its adoption may take another decade.",
      "content": "Blockchain technology has had a rocky start in the logistics industry, with Danish logistics firm Maersk terminating its blockchain-based supply chain platform last year. However, Hong Kong-based Global Shipping Business Network (GSBN) has not given up on blockchain applications in global trade. In fact, the nonprofit consortium sees blockchain as a crucial logistics tool in the long term.\nGSBN currently operates one of the world’s largest platforms that can be described as an alternative to Maersk’s TradeLens tool, according to a report by the South China Morning Post. The platform is based on a permissioned blockchain with strong data governance, allowing only authorized parties to contribute and consume shipping-related data.\nSince launching its blockchain-based shipping platform in 2021, GSBN has tapped major shipping partners like Cosco, Orient Overseas Container Line, and Hapag-Lloyd. In addition, the organization has also reached partnerships with terminal operators such as Hutchison Ports, SPG Qingdao Port, PSA International, Shanghai International Port Group, and Cosco Shipping Ports. Among the members, only German Hapag-Lloyd and Singaporean PSA International are not based in mainland China or Hong Kong.\nDespite past failures of major industry firms like Maersk in implementing similar projects, GSBN CEO Bertrand Chen is confident that blockchain technology has yet to fully catch on and its adoption may take another decade. However, with the world's largest shipping companies on board, the potential of blockchain in logistics seems promising.\nThe use of blockchain technology in the logistics industry has been a topic of discussion for several years. It is seen as a tool that can increase transparency and efficiency, as well as reduce fraud and errors. However, the adoption of blockchain has been slow due to concerns about security, scalability, and interoperability.\nGSBN's permissioned blockchain platform addresses some of these concerns. With strong data governance, it allows only authorized parties to access data, reducing the risk of data breaches. In addition, by bringing together major shipping partners and terminal operators, the platform aims to increase efficiency and reduce the time and costs associated with shipping.\nWhile Maersk's failed blockchain platform may have dampened enthusiasm for blockchain in logistics, GSBN's platform shows that there is still potential for blockchain in the industry. As the platform gains more traction and more companies adopt blockchain technology, the logistics industry may see a shift towards more transparent and efficient supply chain management.",
      "date": "2023-04-11",
      "author": "luisa crawford",
      "tagList": [
        "gsbn",
        "blockchain",
        "supply chain",
        "logistics",
        "shipping"
      ]
    },
    {
      "link": "https://blockchain.news/news/kazakhstan-based-crypto-miners-face-unprecedented-situation",
      "type": "news article",
      "title": "Kazakhstan-Based Crypto Miners Face Unprecedented Situation",
      "summary": "Kazakhstan-based crypto miners have been witnessing an unprecedented situation as they find themselves surrounded by uncertainty due to political forces.",
      "content": "Kazakhstan-based crypto miners have been witnessing an unprecedented situation as they find themselves surrounded by uncertainty due to political forces.\nThe country’s fast-growing cryptocurrency mining industry was affected last week when it was trapped in a nationwide internet shutdown amid a deadly uprising that began with protests in the west of Kazakhstan against a New Year's Day fuel price hike.\nThe move likely prevented Kazakhstan-based miners from accessing the bitcoin network, Reuters reported.\nWhile CNBC said, citing comments from Kevin Zhang of digital currency company Foundry, the internet blockage sent an estimated 15% of the world’s bitcoin miners offline.\nOn January 7th, due to the volatile situation bitcoin tumbled under $41,000 as it slumped as much as 5% to its lowest since late September.\nEthereum also saw a dip as it dropped below $3,200 Friday morning after trading above $4,000 for much of December 2021.\nCryptocurrencies such as bitcoin are created or \"mined\" by using high-powered computers which are interconnected globally and compete with each other to solve complex mathematical puzzles in a highly energy-intensive process.\nAccording to the most recent data available from August 2021, Kazakhstan accounted for 18% of the global \"hashrate\" - a crypto term for the amount of power being used by computers linked to the bitcoin network.\nIn April, before China's latest clampdown on bitcoin mining, the figure was just 8%.\nCrypto mining scene\nSince the Chinese clampdown of cryptocurrencies in 2021, many crypto miners migrated to the United States and Kazakhstan, which has led the two countries to become the first and second-largest centres for bitcoin mining respectively.\nAlthough reports have stated that the internet services have now been restored, the situation raises a question about the confidence of crypto miners towards the tightly controlled former Soviet state's political stability and future scenario of the domestic crypto landscape.\nAccording to a November 26, 2021, report by Blockchain.News, power shortages have already been causing some cryptocurrency mining firms to leave Kazakhstan and move to other nations.\nCrypto mining company Xive announced on November 24 that it will move its mining farm out of Southern Kazakhstan due to electricity shortages.\nDidar Bekbau, the co-founder of Xive cryptocurrency mining firm, talked about the development and said that the firm is shutting down a 2,500-rig mine in South Kazakhstan because of a lack of adequate electricity supply from the national grid.\nCrypto miners such as Energix and Xive, have been facing electricity issues since September 2021 because of the rationing from KEGOC, the national grid operator of Kazakhstan.\nBekbau disclosed that some crypto mining firms are moving from the country to places like Russia and the U.S. as there are no options left in Kazakhstan.\nKazakhstan's crypto landscape was not as gloomy as it is now.\nAccording to a September 3, 2020, report by Blockchain.News, the crypto miners safe haven had confirmed in a government meeting that the country was on track with its crypto mining farm projects.\nThe Minister of Digital Development, Bagdat Mussin, had said that the country was in talks to attract about 300 billion tenges ($714 million) of investment to fund the project which it first proposed back in July.\nWhile in June 2022, the central Asian country made plans to attract $738 million in investments related to cryptocurrencies and digital mining activities over the next three years.",
      "date": "2022-01-10",
      "author": "aaron limbu",
      "tagList": [
        "blockchain",
        "bitcoin",
        "kazakhstan",
        "crypto",
        "cryptocurrency"
      ]
    },
    {
      "link": "https://blockchain.news/news/line-messaging-app-launches-digital-asset-wallet-platform-run-dapps-tokens",
      "type": "news article",
      "title": "LINE Messaging App Launches Digital Asset Wallet and Blockchain Platform to Run Dapps and Tokens",
      "summary": "LINE communications app recently launched a new blockchain digital wallet that can be used to manage various crypto assets.",
      "content": "LINE communications app recently launched a new blockchain digital wallet that can be used to manage various crypto assets.",
      "date": "2020-08-27",
      "author": "shine li",
      "tagList": [
        "line",
        "blockchain",
        "link",
        "dapps",
        "line communication app",
        "messaging app",
        "digital wallet",
        "crypto asset",
        "blockchain developer",
        "bitmax wallet",
        "restfful api",
        "tokens"
      ]
    },
    {
      "link": "https://blockchain.news/news/tokens.com-corp-launches-hulk-labsfocusing-on-gamfi-and-nft",
      "type": "news article",
      "title": "Tokens.com Corp Launches Hulk Labs, Focusing on GamFi and NFT",
      "summary": "Toronto-based publicly-traded Blockchain technology company Tokens.com Corp has launched Hulk Labs, a platform focusing on Crypto gamefi and NFT investment.",
      "content": "Toronto-based publicly-traded Blockchain technology company Tokens.com Corp. has launched Hulk Labs, a platform focusing on Crypto-Play-to-Earn gaming and Non-fungible token (NFT) investment.\nIn addition to crypto staking and Metaverse businesses, Hulk Labs provides and monetizes investment opportunities in the gaming and NFT space for Tokens.com shareholders. Hulk Labs, a subsidiary of Tokens.com, will represent Tokens.com's new Web3 vertical, focusing on the Play-to-Earn (P2E) space.\nPlay-to-earn (P2E), or GameFi, is the next major opportunity for Web3 and blockchain.\nP2E is a popular business model that stays in the blockchain game world that integrates both Web3 and blockchain, which corresponds to the F2P (Free to Play) model common in the real world of the game industry.\nAndrew Kiguel, CEO of Tokens.com, expressed his great pleasure to enter the new Web3 vertical with an excellent team, and hoped that in addition to providing investors with crypto assets related to Metaverse, DeFi and NFT, it will also develop games, becoming \"one of the only public companies to offer a complete range of Web3 exposure\"\nHe also added that the crypto gaming industry has grown dramatically over the past two quarters, with more than 600 games and a multi-billion dollar cryptocurrency market cap.\nTokens.com is a publicly-traded company that uses shareholder capital to invest in digital assets used for crypto staking and DeFi and also provides transaction processing and validation services for various digital assets that power Decentralized Finance (DeFi) applications and Non-Fungible Token (NFT ) platforms.\nThe corporation is listed on exchanges in three different countries: Canada's NEO Exchange: COIN; Germany's Frankfurt Stock Exchange: 76M; OTCQB United States: SMURF.\nEarlier this month, the Professional drone racing League (DRL) joined the Metaverse world by launching its first game. A money-making crypto sports game on the Algorand blockchain in partnership with Playground Labs, a Web 3 game developer from crypto investment fund Hivemind.",
      "date": "2022-01-19",
      "author": "annie li",
      "tagList": [
        "blockchain",
        "bitcoin",
        "tokens.com",
        "play-to-earn",
        "p2e",
        "gamefi",
        "nft",
        "hulk labs"
      ]
    },
    {
      "link": "https://blockchain.news/news/compound-protocol-halts-supply-of-four-tokens-due-to-low-liquidity",
      "type": "news article",
      "title": "Compound Protocol Halts Supply of Four Tokens Due To Low Liquidity",
      "summary": "Decentralized lending protocol Compound has decided to pause the supply of four tokens used as lending assets for collateral on the platform, including ncZRX, cBAT, cMKR, and cYFI.",
      "content": "After many votes in favour of it, the decentralized lending protocol Compound has decided to pause the supply of four tokens used as lending assets for collateral on the platform.\nDue to their low liquidity in the market, Compound protocol recently set out a proposal to the community for halting four tokens, including cZRX, cBAT, cMKR, and cYFI.\nAccording to the Proposal, if these tokens don’t get paused, an oracle manipulation-based attack similar to the one that cost Mango Markets millions of dollars is much less likely to occur on the Compound protocol due to these tokens' much less liquidity.\nOverall, this proposal has received overwhelming support from the community, with approximately 554,126 votes in favour of it, representing 99.99% of the votes. Only a single voter cancelled the proposal by voting against it.\nThe compound protocol has now fulfilled the proposal and paused these tokens. This means the said tokens will not be available to users to deposit and/or take loans in order to protect the protocol from market manipulation attacks.\nCompound founder Robert Leshner, who voted in favour of the Proposal, said in an Unchained Podcast that the Mango exploits served as a wakeup call for lending protocols. Because of that, lending protocols should put it into consideration to review their risk parameters.\n“Every protocol has to address the risk parameters assuming that some black hat hacker is going to try to exploit it. It’s a great wake-up call for every DeFi project on every single blockchain to take this as a wake-up call,” said Leshner.\nThe Mango Markets hack is indeed a caution for protocols in the DeFi ecosystem to take note of. The hacker stole over $100 million from the trading and lending platform after manipulating the price of the Mango Market's native MANGO token via an oracle price manipulation attack.",
      "date": "2022-10-26",
      "author": "samuel edyme",
      "tagList": [
        "blockchain",
        "cryptocurrency",
        "tokens",
        "defi",
        "protocol"
      ]
    },
    {
      "link": "https://blockchain.news/news/smart-contracts-enables-commodity-trading-transformation-gscg-report-shows",
      "type": "news article",
      "title": "Smart Contracts Enables Commodity Trading Transformation, GSCG Report Shows",
      "summary": "Given that commodity trading is highly fragmented, blockchain-driven smart contracts can transform this sector by redefining market transactions and transparency, according to a Global Smart Commodity Group (GSCG) report.",
      "content": "Given that commodity trading is highly fragmented, blockchain-driven smart contracts can transform this sector by redefining market transactions and transparency, according to a Global Smart Commodity Group (GSCG) report.\nThrough the latest report dubbed “Commodity Wisdom: How Smart Contracts Are Changing Supply Chain Management,” GSCG highlights that smart contracts will be the gold standard for commodities platforms because they will render data integrity, traceability, and transparency.\nJack Bouroudjian, GSCG’s chairman, pointed out:\nBased on market diversification, getting precise information about commodities has become more pressing, and smart contracts seek to fill the loophole. Bouroudjian added:\nSince data is the lifeblood of digital transformation, smart contracts will help maintain its provenance.\nRobert Alberghine, the president and CEO of GSCG, noted:\nMeanwhile, payments giant Mastercard partnered with GrainChain to spur blockchain provenance in the commodity supply chain in North America and Latin America, Blockchain.News reported.",
      "date": "2022-07-07",
      "author": "brian njuguna",
      "tagList": [
        "commodity",
        "market",
        "blockchain",
        "smart contracts",
        "gscg",
        "research"
      ]
    },
    {
      "link": "https://blockchain.news/news/crypto-alert:-revolutionary-dgt-token-community-presale",
      "type": "news article",
      "title": "Crypto Alert: Revolutionary DGT Token Community Presale",
      "summary": "Tallinn, Estonia, 8 January 2021 DGBLabs OÜ, announces it Community Presale of the DataGrid Token (DGT) for 22nd- 26th January offering a 5% bonus, which is reduced 1% a each day during the sale, on a minimum of one quarter ETH at the price of $.005. Higher Bonus levels available for purchases over 80 ETH. Participants will be required to complete WhiteListing on Blockpass prior to the sale date.",
      "content": "Tallinn, Estonia, 8 January 2021 DGBLabs OÜ, announces it Community Presale of the DataGrid Token (DGT) for 22nd - 26th January offering a 5% bonus, which is reduced 1% a each day during the sale, on a minimum of one quarter ETH at the price of $.005. Higher Bonus levels available for purchases over 80 ETH. Participants will be required to complete WhiteListing on Blockpass prior to the sale date.\nThis sale of the DataGrid Token is for an erc20 token which will be exchanged 1:1 when the DataGrid Blockchain mainnet is launched. Details of the entire presale can be found on https://www.dgblabs.io where interested token purchasers can begin the WhiteList process.\nThe DataGrid Blockchain (DGB) will offer scaling beyond other blockchains, achieved through our eXtensible Blockchain Object Model (XBOM). XBOM will deliver full parallelization by allowing us to store state in accounts and move accounts across shards, so as more nodes are added throughput increases in speed to the maximum transaction rate allowed by the bandwidth of the internet.\n“DataGrid Blockchain will be easy to develop for, like creating a mobile app, enabling great user experiences that happen to be on the blockchain,” said Michael Holdmann, Founder and Chief Executive Officer. “DGB will make development of applications 100x faster and easier to maintain.”\nDataGrid Blockchain designed with an efficient hybrid Distributed PoW/PoS consensus that will deliver the highest resistance to attack.\n“If you have the fastest, easiest to develop for, and most secure blockchain driven by a steady currency, wouldn’t you expect that to deliver high returns?” asked, Jay Moore, Co-Founder and Chief Marketing Officer.\nAbout: DGBLabs OÜ is an Estonian private limited company coordinating the DataGrid Token sale. The token is not for sale to residents of the USA or any jurisdictions that restrict the purchase of cryptocurrency. About: Blockpass is a unique, reusable digital identity (DID) solution for any organizations that participate in regulated industries and in the increasingly remote business environment where trust needs to be verified digitally.",
      "date": "2021-01-08",
      "author": "news publisher",
      "tagList": [
        "blockchain",
        "bitcoin",
        "estonia",
        "presale",
        "tokens",
        "blockchain",
        "xbom",
        "pow",
        "pos"
      ]
    },
    {
      "link": "https://blockchain.news/news/ethereum-continues-to-grow-in-use-and-price-in-2020-but-why",
      "type": "news article",
      "title": "Ethereum Continues to Grow in Use and Price in 2020, But Why?",
      "summary": "If Ethereum can continue to dominate gaming spaces and build on its marketplace, fighting off other platforms in the market, then 2020 could be a significant year for the cryptocurrency. Learn more about why below.",
      "content": "The Ethereum blockchain has been a platform enabling new tokens' initial life in cryptocurrency. Many developers use Ethereum as the go-to chain to create their business and tokenonomy (Token economy) before launching into the markets on exchanges and other services.\nAlready in 2020, the price has seen significant increases, rising from $120 to over $225 in under two months. But is there any reason why?\nIn 2019, Ethereum decentralized apps (Dapps) showed huge advancements in popular segments including gaming and sports.\nFollowing 2019’s growth, wallet holders have seen huge further increases during the start of 2020, with over 80% of new daily active wallets in use from Dapps as well as games and marketplace users jumping up a huge 163%.\nGames are the most popular category on Ethereum’s decentralized marketplace, with the segment seeing a 7% increase in titles and new launches over the past months for players to enjoy.\nThe continued increase and interest in gaming alone is a huge reason why Ethereum continues to expand and attract new users. This could certainly be seen as to why the price has also seen steady rises. In January 2020 we can conclude that after a 7% increase so soon in the year, Ethereum is showing signs of real promise.\nIf Ethereum can continue to dominate gaming spaces and build on its marketplace, fighting off other platforms in the market, then 2020 could be a significant year for the cryptocurrency. Gaming, sports, and decentralized finance will be the driving factor as well as how the latest updates to the chain affect performance. The timing comes when the long-awaited Constantinople update will finally take place as well, creating quite the momentum for blockchain's largest and robust platform.",
      "date": "2020-02-12",
      "author": "geoffrey gardiner",
      "tagList": [
        "blockchain",
        "ethereum",
        "dapp",
        "gaming",
        "enterprise ethereum",
        "ether price"
      ]
    },
    {
      "link": "https://blockchain.news/news/chinas-president-xi-jinping-asks-asean-countries-to-join-hands-in-building-a-digital-silk-road",
      "type": "news article",
      "title": "China’s President Xi Jinping Asks ASEAN Countries to Join Hands in Building A ‘Digital Silk Road’",
      "summary": "China’s President Xi Jinping is calling for greater collaboration among ASEAN member states and has asked them to promote a ‘Digital Silk Road’ in the region.",
      "content": "As China moves to cement its influence in the Asia-Pacific region, Chinese President Xi Jinping has promised to further strengthen cooperation and promote a “digital Silk Road” with ASEAN member states.\nOn November 27, President Xi assured the Asian leaders that China’s top priority is to develop its relationship with the Asean (Associations of Southeast Asian Nations) – 10 countries in the Southeast Asian region including Vietnam, Thailand, Singapore, Malaysia, Laos, Cambodia, Indonesia, the Philippines, Brunei, and Myanmar.\nXi’s speech comes just two days after President-elect Biden announced that his foreign policy agenda would see the U.S strengthens its relations and initiate a new leadership role in the Asia-Pacific.\nWhile speaking via a video link to partners and participants at the China-ASEAN Expo in the Southwest Chinese city of Nanning, Xi said:\nXi said this while referring to his Belt and Road initiative project to build infrastructure, investment, and trade along both ancient maritime and land Silk Roads (sea and land routes connecting South Asia and East Asia with Persia, South Asia, the Arabian Peninsula, East Africa, and Southern Europe).\nXi mentioned that China aims to collaborate with Asean nations to develop a “China-Asean digital port to promote digital connectivity, and build a ‘digital Silk Road’.”\nXi revealed his plans to lead China towards building close relationships with Asean to address pressure from the prolonged trade war caused by US President Trump in 2018.\nChina Embracing Blockchain Technology\nSo far there is no suggestion that the digitalization would involve the use of blockchain technology. However, President XI previously praised and regarded the technology as a breakthrough application, saying that China should seize opportunities presented by blockchain. Xi reiterated the importance of blockchain and the need to accelerate the development of the technology in the country in various sectors. Over 500 blockchain projects have been registered with China’s government.\nChina is poised to take the lead in blockchain after the country’s leader President Xi gave a strong backing to the technology. The move sets to allow the world’s second-largest economy to control the development of the nascent technology in the absence of competition from the U.S and Europe.\nAs China seeks to develop closer ties and trade relations in the Asean region, it is possible that the digital yuan, a CBCD project by China’s Central Bank, would be accepted in these countries. China intends to build a payment network autonomous from the U.S dollar, which remains the most popular medium for international business transactions. As the world moves to digital, China authorities remain committed to launching digital yuan so that the CBDC could get dominance by facilitating cross-border transactions in the region.",
      "date": "2020-11-28",
      "author": "nicholas otieno",
      "tagList": [
        "china",
        "president",
        "asean",
        "belt and road",
        "blockchain",
        "digital yuan"
      ]
    },
    {
      "link": "https://blockchain.news/news/circle-ceo-tells-us-treasury-department-provide-meaningful-safe-harbor-crypto-industry",
      "type": "news article",
      "title": "Circle CEO Tells US Treasury Department to Provide a \"Meaningful Safe Harbor\" for the Crypto Industry",
      "summary": "Circle CEO wants the US Treasury Department to provide improved regulation that can offer a “meaningful safe harbor” for players within the cryptocurrency.",
      "content": "Jeremy Allaire, the Chief Executive Officer (CEO) of Circle, a US-based peer-to-peer payments company, has sent a letter to the United States Treasury Department calling for an improved regulation that can offer a “meaningful safe harbor” for players within the cryptocurrency ecosystem.\nAllaire’s letter was inspired by the recent news that the outgoing Donald Trump’s administration through the Treasury Department is planning to enact a regulatory ban over self-hosted crypto wallets.\nIn his letter, Jeremy recanted his experience at the beginning of the internet boom decades ago noting that he correctly predicted that the then-emerging technology will take over open communications networks despite the imminent fears of risks that prevailed at the time. Jeremy noted that the events of 1996 are seemingly playing out with open-source blockchain networks of today, a move the government is planning to clamp down on.\nHe also noted that the innovations of public blockchains are currently been used around the world to service clients across various industries and that any attempt to bring in strict regulations will give China an upper hand in the race for supremacy in the Blockchain and cryptocurrency ecosystems.\nAllaire noted that the industry is working assiduously to prevent the technology from been harnessed by bad actors, which is one of the basic and biggest fears of the Treasury Department. Per the Circle CEO's words:\nThe CEO then suggested that the Treasury Department should give the industry players about a year or two to implement technologies that can help in ensuring compliance with Know Your Customer (KYC) policies and other transaction-reporting requirements, a move that will not hinder the innovations currently available in the blockchain ecosystem.\nJeremy Allaire's proposal echoes some US lawmakers who have also expressed concerns over the proposed legislation as reported by Blockchain.news.",
      "date": "2020-12-11",
      "author": "godfrey benjamin",
      "tagList": [
        "blockchain",
        "cryptocurrencies",
        "circle",
        "treasury department",
        "jeremy allaire"
      ]
    },
    {
      "link": "https://blockchain.news/news/talent-protocol-supports-the-next-generation-of-builders-through-the-acquisition-of-agora-labs",
      "type": "news article",
      "title": "Talent Protocol supports the next generation of builders through the acquisition of Agora Labs",
      "summary": "Talent Protocol, the web3 professional community for high-potential builders, has acquired Agora Labs, a social token and NFT infrastructure platform for creators to build and scale their communities. The acquisition will not only integrate Agora’s tech stack and community into Talent Protocol, but also onboard its young talented founders, Matthew Espinoza (CEO) and Freeman (CTO) into the team.",
      "content": "",
      "date": "2022-10-05",
      "author": "blockchain.news marketing",
      "tagList": [
        "blockchain",
        "bitcoin"
      ]
    },
    {
      "link": "https://blockchain.news/news/zilliqa-declares-the-establishment-of-the-zilliqa-group",
      "type": "news article",
      "title": "Zilliqa declares the establishment of the Zilliqa Group.",
      "summary": "Zilliqa Research Pte. Ltd. has formed the Zilliqa Group, a conglomerate focusing on Web3 and blockchain-based products, including gaming and decentralized finance, with a restructured board overseeing the transition.",
      "content": "Zilliqa Research Pte. Ltd., the entity behind the high-performance Zilliqa blockchain, has announced the establishment of the Zilliqa Group. This integrated conglomerate is set to pioneer in delivering advanced Web3 and blockchain-based products and solutions. The Zilliqa blockchain remains at the heart of this Group, supporting both the Group's companies and the broader decentralized applications within the Zilliqa ecosystem.\nThe shift to the Zilliqa Group aims to bring together a variety of industry verticals under one unified structure. This includes the recently separated gaming division, Roll1ng Thund3rz (RTz), and anticipates the launch of ventures in areas such as the spatial web, loyalty, decentralized finance, and more. A distinctive services layer is also highlighted across the Group's framework.\nThe transition process will be supervised by a restructured board of directors. Mark Hemsley, previously the Chairman of Zilliqa Research, will now chair the Zilliqa Group. The board will also see the continued participation of Zilliqa co-founder Juzar Motiwalla, maintaining his directorial role. Another significant addition to the board is Zilliqa co-founder Max Kantelia, whose expertise in advising businesses is expected to be pivotal in shaping the Group's future trajectory. Kantelia's involvement is anticipated to open doors to diverse sectors, including luxury goods and corporate social responsibility.\nThe Zilliqa Group's daily corporate operations and decision-making will be centralized under a CEO Office. This office will comprise Group CEO Matt Dyer, Zilliqa CTO Richard Watts, and Sandra Helou, the newly appointed GCC lead for Zilliqa Group. This appointment marks the Group's initial move towards expansion in the GCC region.\nThe announcement's commentator, Mark Hemsley, Chairman of Zilliqa Group, said, \"The establishment of Zilliqa Group symbolises a significant point in our path. We are forging forward on a new path that will see us leading improvements in the Web3 and blockchain domains for many years to come by merging our variety of companies. This will help us stand out in a fast-moving and competitive market.\nMatt Dyer, CEO of Zilliqa Group, echoed this sentiment, emphasizing the Group's commitment to consistently innovate and set industry standards. Max Kantelia, co-founder of Zilliqa and new board member of Zilliqa Group, expressed his enthusiasm for the Group's expansive vision and the potential it holds.",
      "date": "2023-08-24",
      "author": "rebeca moen",
      "tagList": [
        "zilliqa",
        "zilliqa group",
        "blockchain",
        "zil",
        "web3"
      ]
    },
    {
      "link": "https://blockchain.news/news/tennis-star-naomi-osaka-becomes-ftxs-global-ambassador",
      "type": "news article",
      "title": "Tennis Star Naomi Osaka Becomes FTX's Global Ambassador",
      "summary": "Four-time tennis grand slam singles champion Naomi Osaka becomes FTX's global ambassador, becoming one of the first major female professional athletes to partner with FTX.",
      "content": "Four-time tennis grand slam singles champion Naomi Osaka becomes FTX's global ambassador, becoming one of the first major female professional athletes to partner with FTX.\nNaomi Osaka will also receive an equity stake in FTX Trading Limited and will be paid in cryptocurrency.\nAt the Miami Open, Naomi Osaka will wear the FTX logo and will use her popularity to bring the female community to the FTX platform, cementing the FTX crypto exchange's position as the world's leading cryptocurrency exchange and leading more interest in digital assets of people into the Web3 future.\nthe CEO of FTX, Sam Bankman-Fried, comments that:\n\"Just as FTX is at the forefront of crypto markets, we want to be at the forefront of social change. Our partnership with Naomi Osaka will further our goal of getting more diverse voices involved in the future of digital currency and Web3. I am excited to work with Naomi as we look to educate those groups and create a positive impact in the world.\"\nMore females participate in the crypto space and demonstrate good knowledge in this industry. Earlier this month, Crypto financial services firm BlockFi has released the third edition of its Real Talk quarterly survey.\nNearly one-third of women surveyed plan to buy cryptocurrencies in 2022, and 60% of respondents plan to purchase cryptocurrencies within the next three months.",
      "date": "2022-03-22",
      "author": "annie li",
      "tagList": [
        "blockchain",
        "bitcoin",
        "naomi osaka",
        "ftx",
        "crypto",
        "exchange"
      ]
    },
    {
      "link": "https://blockchain.news/news/bitcoin-may-tumble-to-10k-study-shows",
      "type": "news article",
      "title": "Bitcoin May Tumble to $10K, Study Shows",
      "summary": "According to Bloomberg, the latest survey by Bloomberg MLIV Pulse shows that Bitcoin may be heading towards the $10,000 mark.=",
      "content": "According to Bloomberg, the latest survey by Bloomberg MLIV Pulse shows that Bitcoin may tumble to the $10,000 mark.\nThe global speculative frenzy in the financial market due to the COVID-19 epidemic has once again crushed the cryptocurrency market.\nSince the epidemic is gradually brought under control, the market value of cryptocurrencies has evaporated by about $2 trillion. Compared with the end of last year, many investors, mainly retail investors, are worried about the current cryptocurrency.\nThat's according to 950 responses to MLIV Pulse's weekly survey from retail investors, portfolio managers, and strategists around the world.\n60% of respondents said that Bitcoin is likely to halve in value, and the coin is more likely to fall to $10,000 than to rebound to $30,000.\nBitcoin's price hasn't touched the $10,000 mark since September 2020, compared to an all-time high of over $68,000 in November last year. At the time of writing, Bitcoin was trading at $20414 during the Asia trading section.\nJared Madfes, the partner at Tribe Capital, a venture capital firm, emphasized that expectations for further Bitcoin declines reflect \"inherent fear in the market\", adding, \"It's very easy to be fearful right now, not only in crypto, but generally in the world.\"\nAccording to the latest MLIV Pulse survey, 28% of respondents feel confident in the future of cryptocurrencies, but 20% said they are worthless.\n\"Bitcoin still is powering large parts of the crypto-verse, while Ethereum is losing its lead,\" said Ed Moya, senior market analyst at Oanda Corp., a foreign-exchange broker.\nBitcoin's development remains bumpy. The United States Treasury Department delivered a crypto framework to President Joe Biden as instructed in the Executive Order (EO) issued in March.",
      "date": "2022-07-11",
      "author": "annie li",
      "tagList": [
        "blockchain",
        "bitcoin",
        "mliv pulse"
      ]
    },
    {
      "link": "https://blockchain.news/news/ether-soars-to-all-time-high-above-4.4k-gains-reach-up-to-3.5-percent",
      "type": "news article",
      "title": "Ether Soars to All-time-high Above $4.4K, Gains Reach up to 3.5%",
      "summary": "Ether soared to a record to all-time-high above $4,400, gaining as much as 3.5% to $4,403.93, topping the previous record of $4,379.62 reached in May.",
      "content": ".Ether soared to a record above $4,400 Friday, gaining as much as 3.5% to $4,403.93, topping the previous record of $4,379.62 reached in May.\nAccording to data from CoinGecko.com, Ether is now worth about $520 billion. The digital asset went up on bullish sentiment surrounding an upgrade to the Ethereum network and rival Bitcoin’s recent rally to a high of its own.\nThe second-largest cryptocurrency’s latest achievement comes as the digital token has far outperformed Bitcoin throughout this year. Ether beat Bitcoin with a sixfold increase amid surging retail and institutional investor interest.\nFollowing the debut of the first Bitcoin-linked exchange-traded fund in the U.S., the cryptocurrency rose some 40% this month to peak a record of almost $67,000.\nOther smaller tokens, including Binance Coin and Solana, rallied.\nEther underpins the affiliated Ethereum Network, the dominant blockchain used for thousands of decentralized applications. Earlier this week, the system got a further boost after an upgrade designed to make it faster and more energy-efficient.\nAlso, Ethereum’s demand for smart contracts continued to top the charts this week.\nSmart contracts are self-executing agreements based on blockchain technology that decreases the demand for centralized intermediates. They have been in high demand in booming sectors like decentralized finance (DeFi) and non-fungible tokens (NFTs). Ethereum has emerged as the sought-after network.\nOn the other hand, the foundation of DeFi is established on blockchain-based smart contracts that fulfil certain financial functions based on the underlying code.",
      "date": "2021-10-29",
      "author": "aaron limbu",
      "tagList": [
        "blockchain",
        "bitcoin",
        "ether",
        "ethereum",
        "crypto"
      ]
    },
    {
      "link": "https://blockchain.news/news/argo-mining-crypto-production-rose-to-219-btcs-in-july",
      "type": "news article",
      "title": "Argo Mining Crypto Production Rose to 219 BTCs in July",
      "summary": "Argo not only mined more Bitcoins in July, but also generated higher revenues than the previous month. The crypto mining firm faced challenges of electricity costs and its 17 series machines during the month of July.",
      "content": "Argo Blockchain plc, a publicly traded cryptocurrency mining firm based in the UK, on Friday, announced its operational update for July 2022.\nDuring the month of July, Argo revealed that it mined 219 Bitcoins as compared to 179 BTCs in June 2022.\nThe company further said its mining revenue in July amounted to £3.89 million [$4.73 million] compared to June's £3.38 million ($4.35 million).\nAs of 31 July 2022, Argo said it held 1295 Bitcoins, out of which BTC Equivalents were 227.\nMining Hardware Machines Update\nDuring the month of July, Argo stated that it completed its machine swap of about 10,000 S19s Antminers, which were hosted with Core Scientific, and finalized its strategic pivot to a self-hosted business model.\nAs a result of the completion of its machine swap, Argo said it now expects to generate better performance from its mining machines and have greater control of operations, including operational expenses.\nApart from that, Argo mentioned that in July it faced operational challenges with its 17 series machines. The company, therefore, conducted a comprehensive review of its entire mining fleet, with a focus on its S17 and T17 miners (collectively, the \"17 series machines\").\nAs a result, Argo identified that it was not the only miner affected by the hitches associated with its 17 series machines. There were also high failures among the 17 series machines in other crypto mining firms in the sector.\nDespite Argo removing the non-operational 17 series machines, its total hashrate at the end of July was around 2.23EH/s. This figure took into account the company’s continued installation of the S19J Pros ordered from Bitmain and the completion of the Core machine swap.\nPeter Wall, Argo's CEO, talked about the development: \"We would like to thank Core Scientific for acting as an invaluable and reliable business partner in this transition period which represents a crucial step for Argo's future development. The completion of the S19 machine's swap marks a further consolidation of our infrastructure, allowing us to retain further control of our operations and adjust them in accordance with our needs at any given time. While there have been some challenges in operating the 17 series machines, we are pleased with the ROI we have achieved on this portion of our mining infrastructure.\"\nFinancing Deal\nMoreover, during the month of July, Argo said it sold 887 Bitcoins at an average price of around $22,670. The firm said it used the proceeds to reduce obligations under a BTC-backed loan agreement with Galaxy Digital and to fund operating expenses and growth capital.\nAs of 31 July 2022, Argo mentioned it had an outstanding balance of $6.72 million under the BTC-backed loan, a huge reduction from the maximum outstanding balance of $50 million in Q2 2022.\nHelios Power Activities\nDuring the month of July, Argo's electricity costs at its Helios facility in Texas continued to rise higher than anticipated in the past. Electricity costs have increased around the world, mainly because of higher natural gas prices stemming from the war in Ukraine, as well as increased demand for electric-powered air conditioning during an unusually hot and dry summer.\nIn the middle of July, Argo said ERCOT (The Electric Reliability Council of Texas, Inc) – a US organization that operates Texas's electrical grid –issued a conservation alert urging all residential, commercial, and industrial electricity users to reduce electricity consumption during specific afternoon hours when electricity demands were at its highest.\nAs a result, Argo and major large-scale Bitcoin miners in Texas, proactively shut down their mining operations and reduced usage by over 1,000 MW, thereby reducing strain on the grid during peak demand.",
      "date": "2022-08-06",
      "author": "nicholas otieno",
      "tagList": [
        "argo blockchain plc",
        "cryptocurrency mining"
      ]
    },
    {
      "link": "https://blockchain.news/news/zksync-parent-firm-sets-to-launch-layer-3-testnet-pathfinder-in-q1-2023",
      "type": "news article",
      "title": "zkSync Parent Firm Sets to Launch Layer 3 Testnet ‘Pathfinder’ in Q1 2023",
      "summary": "Matter Labs has announced a new layer 3 Ethereum scaling prototype called ‘Pathfinder,' which will be released in Q1 of 2023 and could turn out to be the first Layer 3 network built on the Ethereum blockchain.",
      "content": "Matter Labs has announced its pending testnet launch – a new layer 3 Ethereum scaling prototype called ‘Pathfinder,' which will be released in the first quarter of 2023 and could turn out to be the first Layer 3 network built on the Ethereum blockchain.\nMatter Labs is the Ethereum development firm behind zkSync, a Layer 2 scaling network on Ethereum that is set to launch later this month.\nA layer 2 network is built and connected to the base layer (Ethereum). It improves scalability, enabling it to process more transactions at a lower cost.\nIn Matter Labs' latest Medium blog post, the firm announced its layer 3 launch, described as the “path towards unlocking unlimited scalability and customization.”\nThis Layer 3 network will amplify all the benefits of Layer 2 and enable limitless scaling with limitless customization.\n“With zkSync’s Layer 3 solution, developers will be able to choose from 3 data availability options all using the same proving infrastructure for their project. Developers can choose their own trade-offs between price, performance, and security,” said Matter Labs in the announcement.\nThe firm further stated that their Layer 2 solution, zkSync, is there to provide the necessary foundation for the scaling of Ethereum in the ecosystem without devaluing its security or decentralization. But beyond that, it is their vision that unlimited scalability, and as a result, mass adoption comes from Layer 3 and beyond.\nFurthermore, Matter Labs explained that the layer 3 solution, Pathfinder, will replace non-native bridges with native bridges (or “HyperBridges”) and enable native bridging between blockchains.\nNative bridging is moving tokens from one blockchain to another without locking or giving tokens to an intermediary ‘escrow’ bridging platform.\nOnce zkSync finally launches its layer 3 network, it could solve one of the industry's main pain points, as billions of dollars have been stolen through exploits of non-native bridges between Layer 1 and layer 2 blockchains in the past year.\nLast week, the crypto industry witnessed another on-chain hack, with roughly $100 million of Binance Coin (BNB) stolen after an exploit occurred on a bridge between blockchains.\nAccording to figures from blockchain analytics firm Chainalysis, a total of $2 billion has been lost to breaches on cross-chain bridges this year.\nWith this massive amount of money lost to breaches on cross-chain bridges, a Layer 3 network like Pathfinder, which enables the act of native bridging, could be just what the industry needs to avoid these bridge hacks.",
      "date": "2022-10-11",
      "author": "samuel edyme",
      "tagList": [
        "blockchain",
        "zksync",
        "matterlabs",
        "pathfinder",
        "layer3",
        "ethereum"
      ]
    },
    {
      "link": "https://blockchain.news/news/bitcoin-institutionalization-increases-4-fold",
      "type": "news article",
      "title": "Bitcoin’s Institutionalization Increases 4-Fold to Hit Weekly Average of $1.9T",
      "summary": "Since institutional investments started trickling into the Bitcoin (BTC) network, the leading cryptocurrency has prompted exponential growth.",
      "content": "Since institutional investments started trickling into the Bitcoin (BTC) network, the leading cryptocurrency has prompted exponential growth.\nMarket insight provider IntoTheBlock confirmed:\nMicroStrategy, an American business intelligence firm, has been leading the pack in institutional investments based on its continuous BTC accumulation. For instance, it recently bought an extra 7,002 Bitcoins, bringing its portfolio to more than 121,000 BTC.\nThe firm’s CEO, Michael Saylor, acknowledged that Bitcoin was the principal asset in its treasury reserves because it showcased itself as a legitimate investment vehicle superior to cash.\nOn the other hand, MicroStrategy is contemplating lending out its BTC holdings to generate yield.\nConsiderable selling pressure from Asia might be behind the current correction\nAccording to Bitcoin researcher at Glassnode, Johannes:\nOn December 4, Bitcoin slipped to lows of $42K as massive liquidations engulfed the market, resulting in the second-largest daily shed off this year.\nSince then, the top cryptocurrency has been ranging between the $46K and $50K levels. Therefore, it remains to be seen how Bitcoin plays out even though a bullish divergence is being witnessed from a macro scale.\nOn-chain analyst Matthew Hyland explained:\nWhether a breakout will happen in the Bitcoin market, remains to be seen because the multi-month downtrend witnessed on the momentum indicator recently reached an inflexion point.",
      "date": "2021-12-18",
      "author": "brian njuguna",
      "tagList": [
        "bitcoin",
        "institutional investment",
        "cryptocurrencies",
        "bitcoin",
        "btc",
        "crypto",
        "blockchain",
        "bitcoin"
      ]
    },
    {
      "link": "https://blockchain.news/news/messari-raises-35m-in-series-b-round",
      "type": "news article",
      "title": "Messari Raises $35M in Series B Round",
      "summary": "Blockchain-based data analytics platform, Messari has announced the successful completion of its Series B funding round in which it pulled $35 million.",
      "content": "Blockchain-based data analytics platform, Messari has announced the successful completion of its Series B funding round in which it pulled $35 million.\nThe round was led by Brevan Howard Digital and enjoined participation from top investors, including Morgan Creek Digital, Samsung Next, FTX Ventures, and existing investors Point72 Ventures, Kraken Ventures, Uncork Capital, Underscore VC, Galaxy, and Coinbase Ventures.\nComing off as one of the most favoured data analytics platforms serving the crypto ecosystem nowadays, Messari landed $21 million in a Series A round in early August from investors led by Steve Cohen. The August round valued the company at $300 million.\nAs announced, the new funds will be used to bolster its growing team and fast-track the development of new products.\n\"We're excited to welcome a remarkable group of investors as partners in our next phase of growth,\" said Ryan Selkis, Messari's Co-founder & CEO. \"We are committed to providing investors, crypto enterprises, and token communities with the tools they need to participate in the crypto economy. This new funding will help us grow our team, expand internationally, and invest in new data offerings and tools that complete our market-leading product suite.\"\nIn its growth track, Messari confirmed that it has launched two new products, including Protocol Metrics and Data Apps. As explained, Protocol Metrics will enable the customers of the data research platform to \"compare assets across multiple networks through transparent data standardization and analyze the health, growth, and usage of a protocol.\"\nThe Data App platform is ideal for users who want access to customized data sets. Messari said the release of the Data App platform would be in Beta at launch and that it will release the demo for both products at its forthcoming Mainnet 2022 summit. The summit started on Wednesday and will end on Friday, the 23rd.",
      "date": "2022-09-22",
      "author": "godfrey benjamin",
      "tagList": [
        "messari",
        "blockchain analytics",
        "brevan howard digital",
        "ryan selkis"
      ]
    },
    {
      "link": "https://blockchain.news/news/nepal-to-shut-down-crypto-trading-mediums",
      "type": "news article",
      "title": "Nepal to Shut Down Crypto Trading Mediums",
      "summary": "The crypto industry in Nepal is about to witness further setbacks as the government has started to ban trading mediums for digital assets.",
      "content": "The crypto industry in Nepal is about to witness further setbacks as the government has started to ban trading mediums for digital assets.\nAccording to a report by NepalPress, the Nepal Telecommunications Authority (NTA) is shutting down all mobile apps and websites that engage in trading cryptocurrency trading in the country.\nThe report said that this action is being taken to stop the remittance of capital to foreign banks by converting them into cryptocurrency.\nThe NTA started taking action after the Ministry of Communications and Information Technology ordered national internet providers to ban websites and platforms that engage in trading cryptocurrencies.\nSurya Prasad Lamichhane, deputy director at the NTA, confirmed the authority’s action saying that “the government has directed to close the apps after carrying out an investigation.”\nThe Nepalese government has pointed towards crypto trading as a major reason behind rising economic-related crimes and a potential instigator of financial instability.\nIn January, the Nepal Rastra Bank released a directive banning any form of investment or transactions in cryptocurrency or hyper funds. It stated that the action was being taken to fight fraud and illegal outflow of domestic capital.\nThe bank also announced that any Nepali or foreigner living in Nepal and Nepalis abroad is liable to prosecution or further investigation if they are found to be dabbling in virtual currencies.\nNepal Bankers’ Association, the umbrella organisation of commercial banks, shares a similar sentiment towards cryptocurrencies.\nThe association said that virtual currency and network marketing business and transactions are illegal in Nepal.\nHowever, despite warnings, Nepalis have not backed away from investing in cryptocurrencies, according to local media. A report from Nepali Trends said that “cryptocurrency can be the future currency in the world… So, there is a huge suspect that some people are still transacting bitcoin.”\n“It seems that Nepalese are investing in several ways. Some reports show that people are taking help from relatives and friends living abroad to invest in cryptocurrencies,” the publication added.\nHowever, crypto investments continue to remain largely unseen as the government lacks technological tools to track and regulate such transactions, the Nepali Trends report stated.",
      "date": "2022-03-16",
      "author": "aaron limbu",
      "tagList": [
        "blockchain",
        "bitcoin",
        "crypto",
        "cryptocurrencies",
        "nepal"
      ]
    },
    {
      "link": "https://blockchain.news/news/grayscale-investments-opens-trading-for-grayscale-bitcoin-cash-and-litecoin-trusts",
      "type": "news article",
      "title": "Grayscale Investments Opens Trading for Grayscale Bitcoin Cash and Litecoin Trusts",
      "summary": "Grayscale Investments, the world’s largest digital currency asset manager has opened public trading for two prominent altcoins, Bitcoin Cash and Litecoin.",
      "content": "Grayscale Investments, the world’s largest digital currency asset manager has opened public trading for two prominent altcoins, the Grayscale Trust for Bitcoin Cash and Litecoin.\nGrayscale Investments has announced eligible Shares of Grayscale Bitcoin Cash Trust will be available to trade on OTC Markets under the symbol: BCHG and eligible Shares of Grayscale Litecoin Trust will be available to trade on OTC Markets under the symbol: LTCN.\nThe institutional-grade digital asset investment firm Grayscale, has launched these public altcoin offering after receiving the approval of the Financial Industry Regulatory Authority (FINRA) back in July.\nThe BCHG and LTCN trusts are not registered with the United States Securities and Exchange Commission (SEC) but allow mainstream investors exposure to cryptocurrency assets without having to buy and store the tokens themselves.\nInstitutional Interest in Crypto Investments Skyrockets\nGrayscale investments company has been at the forefront of providing a means of investing in cryptocurrency without having to actually hold the digital assets. This service has gained lots of popularity among traditional investors who want to bypass volatility in the crypto space.\nThe Trusts have offered private placements to accredited investors since March 2018. As of July 31, 2020, there were 2,500,800 Shares outstanding of LTCN and each Share represented ownership of 0.09413112 Litecoin. Shares created through each Trust’s respective private placement become eligible to sell into the public market after a statutory one-year holding period under Rule 144 of the Securities Act.\nAll investors with access to US securities will be able to buy and sell freely-tradable shares of BCHG and LTCN through their investment accounts in the same manner as they would other unregistered securities.\nThere is currently $16.8 million worth of BCH under management in the Bitcoin Cash Trust and $13.5 million in Grayscale’s Litecoin Trust. The New York-based Grayscale will take a 2.5% cut of the trust each year—this means that the amount of Bitcoin Cash and Litecoin held in its trust will decrease over time.\nGrayscale has been providing several cryptocurrency products for OTC trading, and the latest being shares of the company’s Litecoin and Bitcoin Cash Trusts for trading on OTC markets. Litecoin and Bitcoin Cash are now the company’s sixth and fifth publicly-traded cryptocurrency products.\nIn the recent past, the company obtained approval to offer shares for Bitcoin (BTC), Ethereum Classic (ETC), and Ethereum (ETH). Zcash (ZEC), Stellar Lumens (XLM), Horizen (ZEN), and XLM are also offered for trading via a trust at the company. These are the largest coins by marketcap on the market, except for Chainlink which recently surged into fifth position.",
      "date": "2020-08-18",
      "author": "lucas cacioli",
      "tagList": [
        "blockchain",
        "bitcoin",
        "litecoin",
        "bch",
        "grayscale",
        "investment",
        "institutional"
      ]
    },
    {
      "link": "https://blockchain.news/news/dutch-central-bank-grants-first-ever-crypto-service-registration",
      "type": "news article",
      "title": "Dutch Central Bank Grants First-Ever Crypto Service Registration",
      "summary": "The Amsterdam Digital Asset Exchange (AMDAX) has secured the De Nederlandsche Bank (DNB) in line with EU Anti Money Laundering guidelines.",
      "content": "The Dutch central bank, De Nederlandsche Bank (DNB) has granted the very first cryptocurrency service registration to the Amsterdam Digital Asset Exchange (AMDAX). Per the landmark registration status, AMDAX can now engage in the processing and custody of digital currencies in line with the European guideline on anti-money laundering guidelines dubbed AMLD5.\nThe co-founder and director of the Amsterdam based exchange Valentino Cremona noted that the registration shows that bitcoin (BTC) investment is actually very transparent as against the general notion that it is only used for scams. The Director also noted that the DNB approval is a step in setting the precedent for a clear regulatory framework that the entire cryptocurrency market needs.\nAlso drawing on the positives of the DNB nod, Cremona noted that “Whereas a growing number of investors consider Bitcoin, as well as other cryptocurrencies as an interesting long-term investment, up until today they were operating on a market that was not regulated. In a time when traditional financial certainties are under pressure, we can offer clients a safe and reliable alternative. As a result of this registration, the crypto domain will also be accessible for private investors and financial institutions.”\nThe Dutch Central Bank’ Nudging Producing Result\nAs one of the major European powerhouses, De Nederlandsche Bank has been up on its toes to bring cryptocurrency firms under a unifying regulation. Blockchain.News reported earlier that the apex bank issue an instruction back in May giving crypto firms a two-week ultimatum to register else, they will face a cease and desist pronouncing halting their operations.\nThe granting of the registration status to AMDAX is one of the positive results from this order and more may come in the coming weeks. The DNB has had its hands tied with the CBDC pursuit and from the recent move with AMDAX, it is obvious the bank is trying not to let there be any loose ends in regulations in anticipation of the digital euro.",
      "date": "2020-10-10",
      "author": "godfrey benjamin",
      "tagList": [
        "blockchain",
        "bitcoin",
        "dnb",
        "cbdc"
      ]
    },
    {
      "link": "https://blockchain.news/news/south-korea-to-pump-in-a-whopping-usd-12-million-into-blockchain-industry",
      "type": "news article",
      "title": "South Korea to Pump In a Whopping $12.8 Million into Blockchain Industry",
      "summary": "The adoption of blockchain technology is set to reach unprecedented levels in major countries, as recently announced by China’s President Xi Jinping. South Korea intends to follow suit based on the revelation made by the Ministry of Science and ICT that USD 12.8 million will be channeled to blockchain projects in 2020.",
      "content": "The adoption of blockchain technology is set to reach unprecedented levels in major countries, as recently announced by China’s President Xi Jinping. South Korea intends to follow suit based on the revelation made by the Ministry of Science and ICT that USD 12.8 million will be channeled to blockchain projects in 2020.\nThis investment strategy seeks to enable South Korea to stamp its authority as a notable blockchain hub across the globe. The ministry has highlighted that the amount will be driven to both private and public sector blockchain projects. Additionally, blockchain experts will be nourished and nurtured through specialized courses nationwide.\nPart of the funding will be availed by the Korea Internet and Security Agency (KISA). It is stipulated that at least USD 8.6 million will be set aside to develop and establish several blockchain projects,\nOn the other hand, the rest will be given to the government-run National IT Industry Promotion Agency (NIPA) to launch a wide range of blockchain-associated courses.\nBoth KISA and NIPA will be mandated with undertaking intensive research on more blockchain regulations as many South Korean investors, and companies have aired their concerns about the government’s stance on the overall blockchain policy.\nAs reported by Blockchain.News on Oct 18, Vietnam is witnessing a sea of activities as Korean blockchain firms seek to close business deals and get new sources of revenue. The Southeast Asian nation has emerged to be a reckoning force in the worldwide blockchain spectrum.",
      "date": "2019-10-30",
      "author": "brian njuguna",
      "tagList": [
        "south korea",
        "blockchain",
        "investment"
      ]
    },
    {
      "link": "https://blockchain.news/news/fv-bank-partners-with-circle-for-instant-usdc-deposits-and-conversion",
      "type": "news article",
      "title": "FV Bank Partners with Circle for Instant USDC Deposits and Conversion",
      "summary": "FV Bank, a global digital bank, has partnered with Circle to enable instant and automatic conversion of USD Coin (USDC) into USD upon deposit for a seamless experience.",
      "content": "FV Bank, a global digital bank, has partnered with Circle to enable instant and automatic USD Coin (USDC) conversion into USD upon deposit.\nPer the announcement:\nCircle is a global financial technology and the USDC issuer. Therefore, the strategic integration seeks to minimize the friction experienced during settlements, making money transfers faster.\nAs a result, FV Bank users will be able to present invoices in USDC to international clients.\nMiles Paschini, FV Bank CEO, stated:\nHe added:\nCircle’s treasury services and transactions are emerging as a stepping stone toward a frictionless value exchange, prompting a new generation of commerce applications and financial services.\nArcane Research had predicted that the USDC would dethrone Tether (USDT) at the top stablecoin seat in October. The market insight provider noted:\nUSDT is one of the leading stablecoins with a market capitalization of $67.98 billion at the time of writing, and USDC comes second with a value of $49.95 billion,according to CoinMarketCap.",
      "date": "2022-09-22",
      "author": "brian njuguna",
      "tagList": [
        "blockchain",
        "fv bank",
        "circle",
        "usdc"
      ]
    },
    {
      "link": "https://blockchain.news/news/local-hong-kong-firms-raise-funds-for-ngo-through-nfts",
      "type": "news article",
      "title": "Local Hong Kong Firms Raise Funds for NGOs Through NFTs",
      "summary": "Three local Hong Kong companies are raising funds for NGOs through NFTs to support green initiatives and sustainability.",
      "content": "Three local Hong Kong companies are raising funds for non-governmental organisations (NGOs) through non-fungible tokens (NFTs) to support green initiatives and sustainability.\nIn its published introduction video clip, the joint effort from travel lifestyle brand Cathay; children's support concept The Hub Hong Kong; and Articoin - an innovative Green NFT platform - started with a painting contest titled \"My Home in Sham Shui Po\", which consisted of over 50 children and teenagers aged between 6 and 18.\nAll of the paintings depict an interpretation of a local community- Sham Shui Po, and are now being sold as NFTs on Cathay's shopping platform - Cathay Shop - and Articoin's Proof-of-Capacity (PoC)2 Green NFT platform.\nJosephine Leung, Executive Director at children's support concept The Hub Hong Kong, said, \"the emergence of blockchain and NFTs offers our charity work a new perspective and possibility. And we are grateful to have two highly-regarded partners and supporters to make this happen together. All net funds raised from the campaign will go to support the much-needed education and development programs for underprivileged children at The Hub Hong Kong.\"\nThe energy source for minting these NFTs is environmentally friendly. Compared to the carbon footprint generated by traditional blockchain consensus algorithms, the Green NFT platform Articoin is backed by the more energy-friendly PoC mechanism, which reduces carbon emissions to a greater extent (2,600 times).\nThese NFTs have been released as limited editions, which can be bought with Asia Miles, cash or Miles Plus Cash on Cathay's shopping platform, Cathay Shop, and redeemed on Articoin. However, buyers can also purchase them directly through Articoin's platform by credit card and debit card.\nAndy Wong, General Manager of Corporate Affairs at Cathay, said, \"through these NFTs, we hope to provide an innovative new way for people to lend their support to the incredible charitable work being done to help the vulnerable in our community.\"",
      "date": "2022-06-02",
      "author": "aaron limbu",
      "tagList": [
        "blockchain",
        "nft",
        "hongkong",
        "cathay",
        "ngo",
        "thehub"
      ]
    },
    {
      "link": "https://blockchain.news/news/mysten-labs-partners-with-alibaba-cloud-to-bolster-sui-blockchain-ecosystem",
      "type": "news article",
      "title": "Mysten Labs Partners with Alibaba Cloud to Bolster Sui Blockchain Ecosystem",
      "summary": "Mysten Labs collaborates with Alibaba Cloud to enhance the Sui blockchain ecosystem, introducing AI-assisted development tools, educational programs, and global infrastructural support.",
      "content": "Mysten Labs, a key developer behind the Sui blockchain, has announced an expanded partnership with Alibaba Cloud. This collaboration aims to bolster the Sui blockchain ecosystem through a series of innovative services, notably leveraging artificial intelligence (AI) technology.\nKey aspects of this partnership include the development of an AI-enabled environment tailored for Sui's Move language developers. Mysten Labs and ChainIDE are jointly creating an AI-assisted tool that simplifies Move code development. This tool, powered by natural language processing, will enable developers to generate Move code from simple prompts. Leveraging Alibaba Cloud’s infrastructure and technical support, this initiative promises to accelerate the pace for seasoned developers and offer a supportive environment for newcomers to the blockchain development space.\nAdditionally, the partnership extends to educational and community-focused endeavors. There are plans to roll out educational programs across universities, emphasizing blockchain and AI technology. Community events are also on the agenda, aiming to foster a more robust and engaged developer network around the Sui blockchain.\nIn a move to make Sui’s resources more accessible globally, Mysten Labs and Alibaba Cloud will translate Move documentation into Mandarin Chinese and Korean, thereby broadening the reach of the Sui ecosystem in key Asian markets. This initiative reflects a strategic approach to cultivate a diverse and global community of developers.\nThe collaboration also includes infrastructural support for the Sui blockchain. Alibaba Cloud will provide full node services on Sui, contributing to the network's scalability and reliability. Furthermore, in partnership with Mysten Labs’ strategic partner ShinamiCorp, Alibaba Cloud will offer Gas Station benefits to Sui builders, which simplifies sponsoring user transactions on the blockchain.\nA key component of this partnership is the support for project incubators. Mysten Labs and Alibaba Cloud will provide cloud infrastructure and organize demo day events in strategic locations like Hong Kong, Singapore, and Dubai. This initiative aims to nurture promising projects that contribute to the growth of the Sui network ecosystem.\nThis collaboration between Mysten Labs and Alibaba Cloud represents a significant step forward in the blockchain space. It combines the technical prowess and innovative approach of Mysten Labs with the cloud and AI capabilities of Alibaba Cloud. The focus on AI-assisted development tools, educational outreach, and infrastructural support is poised to drive significant advancements in the Sui blockchain ecosystem, making it more accessible, robust, and innovative.",
      "date": "2024-01-24",
      "author": "rebeca moen",
      "tagList": [
        "mysten labs",
        "alibaba cloud",
        "sui blockchain",
        "move language",
        "ai development",
        "blockchain education",
        "global expansion",
        "developer tools",
        "community engagement",
        "blockchain infrastructure"
      ]
    },
    {
      "link": "https://blockchain.news/news/ethereum-launches-eth-2.0-multiclient-testnet-medalla",
      "type": "news article",
      "title": "Ethereum Launches ETH 2.0 Multiclient Testnet - Medalla",
      "summary": "Ethereum software developers proudly launched the blockchain project they have been perfecting these past few months, the Ethereum 2.0 multiclient testnet, Medalla.",
      "content": "Ethereum software developers proudly launched the Ethereum 2.0 multiclient testnet, Medalla - the next step on the road to pure Proof-of-Stake.\nOne Step Closer to ETH 2.0 Mainnet\nAs promised, Ethereum launched on August 4, at 1 pm UTC. Ethereum enthusiasts have been anticipating the official release of the testnet since Ethereum software developers have announced that Medalla was in the works and will be the last trial blockchain launched before Ethereum 2.0 mainnet comes into play.",
      "date": "2020-08-04",
      "author": "shine li",
      "tagList": [
        "blockchain",
        "ethereum",
        "ethereum testnet",
        "eth 2.0",
        "vitalik buterin",
        "ethereum foundation",
        "eth",
        "proof-of-stake",
        "pos",
        "mining",
        "defi",
        "medalla"
      ]
    },
    {
      "link": "https://blockchain.news/news/The-first-Pocket-Gamer-and-Blockchain-Gamer-Connects-Hong-Kong-wows-the-crowds",
      "type": "news article",
      "title": "The First Pocket Gamer and Blockchain Gamer Connects Hong Kong Wows the Crowds",
      "summary": "The temperature outside may have been in the high 30s, but that was nothing compared to the white-hot talks and meetings taking place inside Hong Kong’s awesome Cyberport venue on 17-18 July, at Steel Media’s inaugural Blockchain Gamer Connects and Pocket Gamer Connects in East Asia.",
      "content": "The First Pocket Gamer and Blockchain Gamer Connects Hong Kong wows the crowds: more than 750 delegates from 45 countries attend a new B2B gaming conference! The temperature outside may have been in the high 30s, but that was nothing compared to the white-hot talks and meetings taking place inside Hong Kong’s awesome Cyberport venue on 17-18 July, at Steel Media’s inaugural Blockchain Gamer Connects and Pocket Gamer Connects in East Asia. The conference and expo, hosted in association with Animoca Brands and Cyberport, pulled in the great and the good of the games industry from across the region as well as overseas with over 750 delegates registering in total from 45 countries. Less than half of the attendees (48.6%) were from Hong Kong, with 15.5% traveling from mainland China, 6.6% from the United States, 4.4% from Korea, 3.3% Japan and 2.6% hailing from the United Kingdom. The emerging market of South East Asia was well represented too, with attendees from Singapore, Philipines, Vietnam, Malaysia, and Thailand (making up over 7.7% of delegates) whilst Russia and mainland Europe collectively brought in 7.8% and the Middle East and Australasia were also represented.\nThese delegates enjoyed over 55 hours of talks and panels delivered across three packed tracks rooms. Over the span of two days, 131 speakers shared their insight on mobile, esports and blockchain gaming. Highlights included keynotes by Yuichiro Saito (Cygames), Allison Bilas (JoyPac), Sandeep Nailwal (Matic Network), and Huabin Ling (Cocos2dx). The crowd was thrilled by Superstar Sessions on player-owned economies (John Linden, Mythical Games); how gameplay comes first (Kern Zhang, App Annie); scaling Ethereum games (Matt Campbell, Loom Network); and community building (Marguerite deCourcelle, Blockade Games). There were 14 panels, including a lively discussion about the future of instant games, hypercasual and casual games, led by Gamejam’s Christian Calderon.\nMaking Connections Outside of the track rooms, attendees used the free meeting system to schedule 280 hours of business one-to-ones. There were also curated sessions (Investor Connector, and Publisher SpeedMatch), which were invitation-only get-togethers that took place smoothly behind the main stage, bringing together studios, publishers, and investors from around the globe. There were 20 entrants in the Very Big Indie Pitch, the competition that challenges indie developers to pitch their games to panels of experts in speed-dating style quickfire rounds. The ultimate winner was Minidragon, a small company founded in 2013 and are based in Cyberport, Hong Kong. Their game Pixel Petz walked away with the ceremonial baseball bat after impressing the judges with their pitch. 390 companies joined PG and BG Connects Hong Kong 2019 in total. As always at a Connects event, there was a wonderful cross-over of industries, from students to CEOs and top investors. 40% of the registered attendees were C-level.\nSponsors and Supporters Our platinum sponsors were Cyberport and Animoca Brands, who co-organized the event. The event was also supported by Xsolla, Lab Cave, App Annie (gold); UPLTV, Genvid, JoyPac, Matic Network, PlasmaPlay, Minimob, iMoney, Cocos-BCX, Bino Viz (silver); Bluzelle, Upland and Cocos2d (track and associate sponsors). “This was our 19th B2B conference overall and our very first one in the Hong Kong region,” commented Steel Media COO Dave Bradley. “We could not have been more pleased with the support we received from the local and international games community. There was an incredible amount of talent on show in both the blockchain and mobile sides of the event. It seems that many new business connections were made. And as always at a Connects event, the vibe was relaxed and friendly, with the party on Tuesday night – with conversations spilling out onto the Cyberport terrace – a particular highlight! We’ll definitely be back in this fascinating city.”\nNext Up\nThe next destination for the international series of events is the sixth edition of Pocket Gamer Connects Helsinki on October 1-2 before wrapping up the year with the first-ever Pocket Gamer Connects Jordan on November 2-3. In 2020, the series will start the year by returning home to London on January 20-21. https://www.pgconnects.com/helsinki/",
      "date": "2019-07-23",
      "author": "judy li",
      "tagList": [
        "blockchain",
        "bitcoin",
        "game"
      ]
    },
    {
      "link": "https://blockchain.news/news/what-global-regulators-think-of-libra-the-asia-pacific-edition",
      "type": "news article",
      "title": "What Global Regulators Think of Libra: The Asia Pacific Edition",
      "summary": "Libra, the new cryptocurrency by social media giant Facebook, has generated controversy with lawmakers and regulators globally since its announcement in June of this year. Concerns were mostly revolved around the stablecoin potentially disrupting the global financial system. The scrutiny towards Facebook aims at the fear that the new digital currency could possibly take power away from the governments.",
      "content": "",
      "date": "2019-10-11",
      "author": "sarah tran",
      "tagList": [
        "blockchain",
        "bitcoin",
        "libra",
        "crypto",
        "regulation"
      ]
    },
    {
      "link": "https://blockchain.news/news/response-to-facebook-libra-eu-banks-can-deploy-payment-system-by-2020",
      "type": "news article",
      "title": "Response to Facebook Libra? EU Banks Can Deploy Payment System By 2020",
      "summary": "All banks in the eurozone could share the instant payment system at the end of 2020, as reported by Reuters on 26 June.",
      "content": "All banks in the eurozone could share the instant payment system at the end of 2020, as reported by Reuters on 26 June.\nThe real time payments are available since 2017. However, only half of the banks in the eurozone have adopted the technology and it is mainly used for domestic payments. Now, the adoption on payment systems may speed up due to the threat from competitors such as Facebook that use cryptocurrencies to facilitate seamless payments across their global users.\nDirector general of the European Payments Council (EPC), Etienne Goosse commented on the impact of Facebook Libra “They come with a global solution, under a global brand offering many things that the consumers seem to find wonderful.” Goosse added that instant payments are being adopted by 60% of lenders and payment service providers within the eurozone, and it is expected to reach to all banks in the bloc by the end of 2020.\nThe European Central Bank launched the TARGET Instant Payment Settlement (TIPS) in November 2018, which enables real-time transaction mitigating fragmentation risks in the European retail payments market. However, it is argued that these mechanisms are not interoperable among lenders that are not members of the same clearinghouse, and each of these systems that cover only a few dozen banks.\nThumbnail image credit: Shutterstock",
      "date": "2019-07-01",
      "author": "henry chan",
      "tagList": [
        "industry",
        "crypto",
        "cryptocurrency",
        "blockchain",
        "epu",
        "tips"
      ]
    },
    {
      "link": "https://blockchain.news/news/south-korean-shared-workspace-company-turns-to-a-blockchain-powered-real-estate-platform",
      "type": "news article",
      "title": "South Korean Shared Workspace Company Turns to a Blockchain-Powered Real Estate Platform",
      "summary": "Sparkplus, a South Korean office sharing company, has announced a partnership with tech startup Kasa Korea for a blockchain-enabled real estate funding platform. Through the strategic collaboration, Sparkplus seeks to revolutionize Seoul’s sharing economy through a decentralized network that would enable people without much money to collectively and indirectly fund real estate.",
      "content": "Sparkplus, a South Korean office sharing company, announced a partnership with tech startup Kasa Korea for a blockchain-enabled real estate funding platform.\nThrough the strategic collaboration, Sparkplus seeks to revolutionize Seoul’s sharing economy through a decentralized network that would enable people without much money to collectively and indirectly generate funds in the real estate sector.\nThis approach is touted to eliminate various challenges, such as low disposable incomes, that hinder the penetration of the real estate industry.\nReal estate tokenization\nSparkplus also revealed that it intended to launch co-working centers at buildings listed on Kasa Korea’s blockchain platform.\nSparkplus CEO, Mok Jin-gun, acknowledged: “With our experience in operating coworking offices, we will work hard to increase the value of the assets that are on Kasa Korea’s platform through this partnership.”\nHe added: “We will work together to provide more business buildings, which is attractive to individual investors on the platform.”\nExpressly, Kasa Korea’s blockchain platform has been crafted in such a way that real estate beneficiary securities are tokenized. This happens through the issuance of crypto asset-backed securities with their collateral as real estate.\nOn the other hand, Sparkplus recently secured 30 billion won ($25.3 million) of series B funding from investors, such as Koramco, Intervest, Aju IB Investment, STIC Ventures, Wooshin Venture Investment, and Aju Hotels and Resorts.\nThis figure brings the total funds raised by the firm to 60 billion won since November 2016. This has enabled Sparkplus to open 12 co-working locations spread across Seoul in affluent regions, such as Gwanghwamun and Gagnam.\nBy leveraging on blockchain technology, innovation and liquidity is being availed in the real estate sector via tokenization.\nOpenBricks, a new blockchain-powered property portal in the UK, is eyeing to be the world's first blockchain-based portal as it won’t have any centralized authority, as well as many staff because it will thrive on agents’ own servers using a distributed ledger network.",
      "date": "2019-12-18",
      "author": "brian njuguna",
      "tagList": [
        "sparkplus",
        "blockchain",
        "kasa korea",
        "seoul",
        "real estate"
      ]
    },
    {
      "link": "https://blockchain.news/news/3.6b-bitcoins-disappeared-with-lossing-contact-founders-south-african-crypto-exchange-africrypt",
      "type": "news article",
      "title": "$3.6B Worth Bitcoins Scam, Founders of South African Crypto Exchange Africrypt Are Missing",
      "summary": "The total value of $3.6 billion Bitcoins disappeared while the founders of South African cryptocurrency exchange AfriCrypt are missing.",
      "content": "The total value of $3.6 billion Bitcoins disappeared while the founders of South African cryptocurrency exchange AfriCrypt are missing, Bloomberg reported.\nA pair of the brother of 20-year-old Ameer Cajee and 17-year-old Raees Cajee founded South Africa-based digital currency exchange AfirCrypt in 2019 to attract high-net-worth individuals and celebrities.\nThe company claimed its platform was hacked on April 13 but urged its investors not to report the incident to lawyers and authorities, claiming the report would hinder the recovery of funds.\nHanekom Law Firm has accepted the request from their client of the victim for further investigation. Yet, the law firm was doubtful and sceptical related to the hacking incident, comment this:\nThe law firm found that later the pair of founders of AfriCrypt immediately moved to the UK after the incident and closed all contact information.\nReportedly, the brothers have transferred 69,000 BTC from AfriCrypt's account and customer wallet to an account in the First National Bank (FNB) in Johannesburg. According to the current bitcoin price, the transaction price of $32,968, worth an estimated $2.275 billion.\nAttorney Hanekom stated that these funds were transferred to various dark web tumblers and mixers, causing challenges with severe fragmentation and untraceable funds.\nThe authority said the investigation was undergoing and transferred the case to a special division of the South African Police Force. Yet, the South African government faces legal challenges due to its incomprehensive laws targeting cryptocurrencies assets.",
      "date": "2021-06-24",
      "author": "annie li",
      "tagList": [
        "blockchain",
        "bitcoin",
        "south africa",
        "africrypt",
        "cybercrime",
        "hacker",
        "scam"
      ]
    },
    {
      "link": "https://blockchain.news/news/hex-trust-announces-integration-of-polkadot-blockchain-network",
      "type": "news article",
      "title": "Hex Trust Announces Integration of Polkadot Blockchain Network",
      "summary": "Hong Kong-based digital asset custody provider Hex Trust announced the integration of Polkadot blockchain network into Hex Safe.",
      "content": "Hong Kong-based digital asset custody provider Hex Trust announced the integration of the Polkadot blockchain network into Hex Safe.\nFollowing the integration, Hex Trust now provides fully licensed custody for Polkadot’s native token (DOT). Hex Trust also has plans to support a full stack of services built on Polkadot.\n“With this integration, we will be offering fully-licensed & highly secure custody for $DOT and the full stack of services built on the leading interoperability blockchain network,” Hex Trust said on Twitter.\nFurthermore, the integration will enable the company’s more than 200 institutional clients to trade, lend and stake DOT without sending their assets outside the secure custody platform Hex Safe.\nAccording to Hex Trust’s official website, Hex Safe helps users secure and manage digital assets with a compliance-first approach.\nHex Safe also provides access to liquidity providers, exchanges and industry-leading DeFi platforms.\nLaunched in May 2020, the Polkadot blockchain network facilitates the interoperability of blockchain networks.\nThe network runs on layer zero, known as Relay Chain, which supports 100 parachains, and sovereign blockchains that work in parallel with a high level of security.\nGiorgia Pellizzari, Head of Custody at Hex Trust, said, “we’re excited to have integrated Polkadot and open up the endless possibilities their emerging ecosystem is enabling. Within Hex Safe, we endeavour for our clients to seamlessly hold and have the ability to trade leading tokens such as Polkadot in our multichain and highly secure custody platform.”",
      "date": "2022-06-27",
      "author": "aaron limbu",
      "tagList": [
        "blockchain",
        "digitalasset",
        "hextrust",
        "hexsafe",
        "crypto"
      ]
    },
    {
      "link": "https://blockchain.news/news/terra-expands-stablecoin-reserve-by-purchasing-100m-worth-of-avalanche-tokens",
      "type": "news article",
      "title": "Terra Expands Stablecoin Reserve by Purchasing $100m worth of Avalanche Tokens",
      "summary": "The Luna Foundation Guard (LFG), primarily focused on the Terra blockchain, expands its TerraUSD (UST) stablecoin reserve by purchasing $100 million worth of Avalanche tokens.",
      "content": "The Luna Foundation Guard (“LFG”), primarily focused on the Terra blockchain, expands its TerraUSD (“UST”) stablecoin reserve by purchasing $100 million worth of Avalanche tokens.\nThe native token of the Avalanche blockchain becomes the second-largest asset in the UST reserve after the Bitcoin token.\nTerra is a blockchain protocol that uses fiat-pegged stablecoins to power price-stable global payments systems, which includes TerraUSD (“UST”) – the flagship stablecoin of the Terra network and the leading decentralized stablecoin in DeFi by market cap\nTerra’s UST stablecoin, backed by bitcoin tokens, could eventually reach $10 billion, the company said. To strengthen the ability of Terra’s UST stablecoin to be pegged to U.S. dollar fiat, the company added $230 million in bitcoin on Wednesday, following an injection of more than $1 billion in bitcoin in January.\nEmin Gün Sirer, CEO of The Ava Labs said that:\nDo Kwon, the founder of Terraform Labs, the blockchain startup in charge of the Terra blockchain and LUNA coin, said Bitcoin will remain the \"primary backer\" for the UST stablecoin, but the deal with Avalanche \"buys Avalanche's UST and Terra a lot of user familiarity.”\nAs reported by blockchain.News on December 9, 2021, one of Asia's biggest Venture Capital firms, Chiron Partners, has launched a $50 million ecosystem fund christened the Chiron Terra Fund I (CTI), aimed at supporting innovative projects that are emerging from the Terra blockchain ecosystem.",
      "date": "2022-04-08",
      "author": "annie li",
      "tagList": [
        "blockchain",
        "bitcoin",
        "terra",
        "terrausd",
        "lfg"
      ]
    }
]